-- create table type(
-- 	id serial primary key,
-- 	name varchar(255)
-- );

-- create table product(
-- 	id serial primary key,
-- 	name varchar(255),
-- 	type_id int references type(id),
-- 	expired_date date,
-- 	price float
-- );

-- insert into type(name) values
-- 	('СЫР'),
-- 	('МОЛОКО'),
-- 	('МОРОЖЕННОЕ');

-- insert into product(name, type_id, expired_date, price) values	
-- 	('Сыр "Голландский", 200 г', 1, '2025-08-15', 278.00),
-- 	('Сыр "Пошехонский", 200 г', 1, '2025-08-12', 261.00),
-- 	('Сыр "Маасдам", 200 г', 1, '2025-09-12', 305.00),
-- 	('Сыр творожный, 140 г', 1, '2025-10-12', 160.00),
-- 	('Сыр "Гауда", нарезка 125 г', 1, '2025-07-10', 204.00),
-- 	('Сыр "Российский" нарезка, 150г', 1, '2025-08-09', 210.00),
-- 	('Молоко топленое 4%, 280 мл', 2, '2025-07-20', 65.00),
-- 	('Молоко 2,5% в бутылке, 900 мл', 2, '2025-07-18', 98.00),
-- 	('Молоко цельное в бутылке, 900 мл', 2, '2025-07-09', 105.00),
-- 	('Молоко ультрапастеризованное 2,5%', 2, '2025-11-20', 130.00),
-- 	('Молоко безлактозное 2,5%, 900 мл', 2, '2025-07-17', 140.00),
-- 	('Молоко (для капучино) ультрапастеризованное 3,2%, 950 мл', 2, '2026-03-20', 152.00),
-- 	('Мороженое "Мятное с Шоколадом"', 3, '2026-09-12', 137.00),
-- 	('Эскимо пломбир ванильный в молочном шоколаде', 3, '2025-11-14', 137.00),
-- 	('Пломбир "Соленая карамель"', 3, '2026-11-14', 135.00),
-- 	('Мороженое "Ванильное" без сахара', 3, '2025-10-14', 150.00),
-- 	('Мороженое молочное с вишней в вафельном стаканчике', 3, '2025-10-18', 90.00),
-- 	('Десерт взбитый замороженный из маракуйи, пюре манго и семян чиа', 3, '2026-10-18', 152.00),
-- 	('Пломбир "Соленая карамель" в ваф. рожке в мол. шоколаде', 3, '2026-09-12', 96.00),
-- 	('Мороженое пломбир в темном шоколаде', 3, '2026-05-12', 305.00),
-- 	('Пломбир шоколадный в вафельном стаканчике', 3, '2025-12-12', 107.00),
-- 	('Мороженое протеин. "Мятная тыква" без сахара', 3, '2025-09-12', 150.00),
-- 	('Пломбир "Бельгийский шоколад"', 3, '2026-08-12', 148.00),
-- 	('Сорбет "Манго-Маракуйя"', 3, '2025-07-06', 105.00);

select * from product
where type_id = 1;

select * from product
where name ilike '%мороженое%';

select * from product
where expired_date < current_date;

select * from product
where price = (select max(price) from product);

select t.name, count(p.price)
from type as t inner join product as p on t.id = p.type_id
group by t.name;

select * from product
where type_id = 1 or type_id = 2;

select t.name, count(p.price)
from type as t inner join product as p on t.id = p.type_id
group by t.name
having count(p.price) < 10;

select p.name, t.name
from product as p inner join type as t on p.type_id = t.id;